//*
//* SYSTEM SYMBOLICS FOR BATCH JOBS ON SYSTEM ZOS1
//*
//* THIS WORKS BEST IF YOU HAVE ONE PER SYSTEM IN A NON-SHARED SYSTEM
//* UNIQUE PROCLIB ACCESSIBLE TO JES2.
//*
//LPARNAME SET LPARNAME=ZOSPROD
//SYSPLEX  SET SYSPLEX=PLEXNAME
//SYSNAME  SET SYSNAME=ZOS1
//*
